In [2]:
import pandas as pd 
import numpy as np 
from pathlib import Path 
data_path = Path('data')

In [3]:
dataset = pd.read_csv(data_path / 'dataset.csv', sep=',')
dataset.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

Loc e Iloc

Loc se basa en etiquetas

In [4]:
dataset['City'].value_counts()

City
New York City      50307
Los Angeles        32173
Dallas             19707
Mountain View      14219
Austin             12292
Boston              8301
Washington D.C.     8120
San Diego           4881
Name: count, dtype: int64

In [5]:
dataset['City'] == 'Dallas'

0          True
1          True
2          True
3          True
4          True
          ...
149995    False
149996    False
149997    False
149998    False
149999    False
Name: City, Length: 150000, dtype: bool

In [6]:
dallas_city = dataset[dataset['City'] == 'Dallas']
dallas_city['City'].value_counts()
#Valores de Dallas

City
Dallas    19707
Name: count, dtype: int64

In [7]:
dallas_female = dataset[(dataset['City'] == 'Dallas') & (dataset['Gender']=='Female')]
dallas_female['Gender'].value_counts()
#Genero femenino en Dallas

Gender
Female    8705
Name: count, dtype: int64

In [8]:
#Se puede filtrar por indices.
dataset.loc[1]

Number           2
City        Dallas
Gender        Male
Age             54
Income     45084.0
Illness         No
Name: 1, dtype: object

In [9]:
dataset1 = dataset.set_index(np.arange(10, len(dataset)+10))
dataset1.head()

    Number    City Gender  Age   Income Illness
10       1  Dallas   Male   41  40367.0      No
11       2  Dallas   Male   54  45084.0      No
12       3  Dallas   Male   42  52483.0      No
13       4  Dallas   Male   40  40941.0      No
14       5  Dallas   Male   46  50289.0      No

In [10]:

dataset1.loc[10]

Number           1
City        Dallas
Gender        Male
Age             41
Income     40367.0
Illness         No
Name: 10, dtype: object

In [11]:
dataset1.loc[10, 'City']

'Dallas'

In [12]:
dataset1.loc[10, ['City', 'Age']]

City    Dallas
Age         41
Name: 10, dtype: object

In [13]:
dataset1.loc[:, ['City','Age']]

          City  Age
10      Dallas   41
11      Dallas   54
12      Dallas   42
13      Dallas   40
14      Dallas   46
...        ...  ...
150005  Austin   48
150006  Austin   25
150007  Austin   26
150008  Austin   25
150009  Austin   37

[150000 rows x 2 columns]

Iloc se basa en posiciones enteras del índice.

In [14]:
dataset1.iloc[0]

Number           1
City        Dallas
Gender        Male
Age             41
Income     40367.0
Illness         No
Name: 10, dtype: object

In [15]:
dataset1.loc[10]

Number           1
City        Dallas
Gender        Male
Age             41
Income     40367.0
Illness         No
Name: 10, dtype: object

In [16]:
#Consultamos el valor de la columna 0 del campo 1.
dataset1.iloc[0,1]

'Dallas'

In [17]:
dataset.iloc[0, 1:3]

City      Dallas
Gender      Male
Name: 0, dtype: object

Iat es parecido a iloc

In [18]:
dataset.iat[0,1]

'Dallas'

In [19]:
dataset.loc[0, 'City']

'Dallas'

In [20]:

dataset.at[0, 'City']

'Dallas'

Slicing

In [21]:
dataset.loc[1:3]

   Number    City Gender  Age   Income Illness
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No

In [22]:

dataset.loc[4:]

        Number    City  Gender  Age    Income Illness
4            5  Dallas    Male   46   50289.0      No
5            6  Dallas  Female   36   50786.0      No
6            7  Dallas  Female   32   33155.0      No
7            8  Dallas    Male   39   30914.0      No
8            9  Dallas    Male   51   68667.0      No
...        ...     ...     ...  ...       ...     ...
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

[149996 rows x 6 columns]

In [23]:

dataset.loc[:3]

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No